app/controllers/v1/mtv_controller.rb

    def news_items_collection
      MtvItem.where("(title) ILIKE '%#{params[:query]}%'")
---
SELECT "mtv_items".* FROM "mtv_items" WHERE ((title) ILIKE '%ab%')